# Группа биологов в институте биоинформатики завела себе черепашку.
#
# После дрессировки черепашка научилась понимать и запоминать указания биологов следующего вида:
# север 10
# запад 20
# юг 30
# восток 40
# где первое слово — это направление, в котором должна двигаться черепашка,
# а число после слова — это положительное расстояние в сантиметрах, которое должна пройти черепашка.
#
# Но команды даются быстро, а черепашка ползёт медленно, и программисты догадались,
# что можно написать программу, которая определит, куда в итоге биологи приведут черепашку.
# Для этого программисты просят вас написать программу, которая выведет точку,
# в которой окажется черепашка после всех команд. Для простоты они решили считать,
# что движение начинается в точке (0, 0), и движение на восток увеличивает первую координату, а на север — вторую.
#
# Программе подаётся на вход число команд n
# , которые нужно выполнить черепашке, после чего n
#
# строк с самими командами. Вывести нужно два числа в одну строку:
# первую и вторую координату конечной точки черепашки. Все координаты целочисленные.
#
# Sample Input:
#
# 4
# север 10
# запад 20
# юг 30
# восток 40
#
# Sample Output:
#
# 20 -20

n = int(input())
a = {'север': [0, 0], 'запад': [0, 0], 'юг': [0, 0], 'восток': [0, 0]}
for i in range(n):
    i = input().split()
    if i[0] == 'север':
        a['север'][1] += int(i[1])
    elif i[0] == 'запад':
        a['запад'][0] += int(i[1])
    elif i[0] == 'юг':
        a['юг'][1] += int(i[1])
    elif i[0] == 'восток':
        a['восток'][0] += int(i[1])

print(int(a['восток'][0]) - int(a['запад'][0]), end=' ')
print(int(a['север'][1]) - int(a['юг'][1]))
